rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    @movies = Movie.where(Director: director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'